from engine import run_engine

if __name__ == "__main__":

    text = """
الهازجة الحمراء هو طائر صغير ينتمي إلى رتبة العصفوريات ويتوطن في مرتفعات المكسيك شمال برزخ تيهوانتيبيك، ويرتبط ارتباطاً وثيقاً مع مجموعة من فوق نوع الهوازج كالهازجة وردية الرأس القاطنة في جنوب المكسيك وغواتيمالا، وهنالك ثلاث نويعات من هذا الطائر، وُجدت في مجموعات منفصلة، وهي تختلف عن بعضها البعض في المقام الأول في لون جانبي الرأس وفي لمعان ونغم ريش الجسم. تكون الطيور البالغة ذات لون أحمر فاتح، مع لون أبيض أو رمادي على جانبي الوجه، اعتماداً على النوع الفرعي؛

"""

    result = run_engine(text, export_path="output/result.json")

    print(result)